app/controllers/appointments_controller.rb

  def update
    if @appointment.update(appointment_params)
---
UPDATE "appointments" SET "patient_name" = ?, "appointment_time" = ?, "updated_at" = ? WHERE "appointments"."id" = ?  [["patient_name", "shi"], ["appointment_time", "2023-10-12 01:00:00"], ["updated_at", "2023-10-12 13:58:06.202473"], ["id", 7]]

  def destroy
    if @appointment.destroy
      render_success_response(I18n.t('appointment.deleted'))
---
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 3]]
DELETE FROM "appointments" WHERE "appointments"."id" = ?  [["id", 9]]

  def set_appointment
    @appointment = Appointment.find(params[:id])
---
SELECT "appointments".* FROM "appointments" WHERE "appointments"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]