app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT "doctors".* FROM "doctors"

  def show
    doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def create
    doctor = Doctor.create!(doctor_params)
---
INSERT INTO "doctors" ("name", "specialty", "created_at", "updated_at", "working_hours") VALUES (?, ?, ?, ?, ?)

  def availability
    doctor = Doctor.find(params[:id])
    appointments = doctor.appointments.pluck(:appointment_time)

    # Define the working hours for the doctor
    working_hours = doctor.working_hours
    available_slots = []

    working_hours.each do |day, hours|
      next if hours == 'Holiday'

      start_time, end_time = hours.split(' - ').map { |time| Time.parse(time) }

      current_time = start_time
      while current_time < end_time
        slot = { day: day, time: current_time.strftime('%I:%M %p') }

        unless appointments.include?(slot[:time]) && slot[:day].downcase == Date.today.strftime('%A').downcase
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "appointments"."appointment_time" FROM "appointments" WHERE "appointments"."doctor_id" = ?  [["doctor_id", 4]]
SELECT "appointments".* FROM "appointments" WHERE "appointments"."doctor_id" = ? AND "appointments"."appointment_time" = ? ORDER BY "appointments"."id" ASC LIMIT ?  [["doctor_id", 1], ["appointment_time", nil], ["LIMIT", 1]]

  def book_slot
    appointment_time_input = params[:appointment_time]
    parsed_time = parse_readable_time(appointment_time_input)

    if parsed_time.nil?
      render_failure_response(I18n.t('doctor.invalid_time'))
      return
    end

    patient_name = params[:patient_name]

    appointment = @doctor.appointments.new(appointment_time: parsed_time, patient_name: patient_name)
    if appointment.save
---
INSERT INTO "appointments" ("patient_name", "appointment_time", "doctor_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["patient_name", "nishi"], ["appointment_time", "2023-10-11 19:00:00"], ["doctor_id", 4], ["created_at", "2023-10-11 15:46:41.813277"], ["updated_at", "2023-10-11 15:46:41.813277"]]

  def set_doctor
    @doctor = Doctor.find(params[:id])
---
SELECT "doctors".* FROM "doctors" WHERE "doctors"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]