app/models/appointment.rb

  def check_overlapping_appointments
    overlapping_appointment = Appointment.where(doctor_id: doctor_id)
                                         .where('appointment_time >= ? AND appointment_time <= ?', appointment_time.beginning_of_hour, appointment_time.end_of_hour)
                                         .where.not(id: id)
                                         .exists?
---
SELECT 1 AS one FROM "appointments" WHERE "appointments"."doctor_id" = ? AND (appointment_time >= '2023-10-09 01:00:00' AND appointment_time <= '2023-10-09 01:59:59.999999') AND "appointments"."id" != ? LIMIT ?  [["doctor_id", 1], ["id", 3], ["LIMIT", 1]]